app/controllers/books_controller.rb

  def index
    if(params[:genre])
      @books = Book.find(:all, :joins => :genre, :conditions => {:genres => {:name => params[:genre]}})
    else
      if(params[:customer])
        @books = Book.find(:all, :joins => :customer, :conditions => {:customers => {:username => params[:customer]}})
       #@books = Book.find(:customerId => params[:customer])
      else
       @books = Book.all
---
SELECT * FROM "books"